#include <iostream>
#include <string>
#include <vector>
#include <map>
using namespace std;

int main()
{
	vector<string> names = { 
		"刘思远","张红涛","孙锡俊","张子杨","胡灿","刘小红","郑文怡","涂文婧",
		"孔雨薇","朱月红","刘芳","黄锦","张结婷","方成","曹明杰","王毅","胡永康","汪玉俊","金伟杰",
		"熊晨洋","沈钇圩","王甜甜","顾冉","缪宇航","陈旭东","姚睿","魏冰娴","黄锦","徐瑾娇","胡煜辉",
		"文杰","周俊雄","胡齐","郑杨","骆莲生","张凯博","杨文浩","魏永雷","权畅","怀志鹏","张竹芹","金伟杰",
		"倪佩佩","王毅","唐健","沈钇圩","汪玉骏","叶晓珍","张红涛","刘齐慧","王雯博","杨佳倩","马菱靖",
		"潘静茹","曹明杰","庞建旺","葛永旺","郝明鑫","郑喆","赵孝艳","韩兴","王晓玉","姜宇杭","张梦玲","杨金盛",
		"陈鑫","李恩祥","周骥","许阳","侯礼诚","丁美雯","武轩昂","周子时" };
	cout << "总人次----" << names.size() << endl;
	map<string, int> name;
	for (auto& e : names)
	{
		name[e]++;
	}
	cout << "总人数----" << name.size() << endl;
	for (auto& e : name)
	{
		cout << e.first << ":" << e.second << endl;
	}
	return 0;
}


//int main()
//{
//	int n;
//	cin >> n;
//	string s;
//	cin >> s;
//
//	return 0;
//}